tutorials/plastic_single_phase/noPillarsSolidsPlastic/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          720;
        startFace       64350;
    }
    inlet
    {
        type            patch;
        nFaces          90;
        startFace       65070;
    }
    outlet
    {
        type            patch;
        nFaces          90;
        startFace       65160;
    }
    emptyFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          64800;
        startFace       65250;
    }
)

// ************************************************************************* //
