tutorials/plastic_single_phase/noPillarsSolidsPlastic/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue epss    1e-5
);

x1 0.00003;
y1 0.00003;
x2 10;
y2 10;
x3 $x1;
y3 0.00002;
x4 10;
y4 -10;
R 3e-4;
epssBiofilm 6e-1;

regions
(

    boxToCell
    {
        box ($x1 $y1 -1.0) ($x2 $y2 1.0);  // Define your rectangular box
        fieldValues
        (
            volScalarFieldValue epss    $epssBiofilm      // Inside cylinder: biofilm (solid)
        );
    }

    boxToCell
    {
        box ($x3 $y4 -1.0) ($x4 $y3 1.0);  // Define your rectangular box
        fieldValues
        (
            volScalarFieldValue epss    $epssBiofilm      // Inside cylinder: biofilm (solid)
        );
    }
);


// ************************************************************************* //
